# ReinforcementRoundingManager Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementRoundingManager Class
Members See Also
---
A base class providing access to reinforcement rounding overrides for structural elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ReinforcementRoundingManager : IDisposable
```

Visual Basic
---
```text
Public Class ReinforcementRoundingManager _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ReinforcementRoundingManager : IDisposable
```

# Remarks
Subclasses of this class are used to access the override settings for Rebar elements and types or Fabric elements and types.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ReinforcementRoundingManager Autodesk.Revit.DB.Structure..::..FabricRoundingManager Autodesk.Revit.DB.Structure..::..RebarRoundingManager
# See Also
ReinforcementRoundingManager Members
Autodesk.Revit.DB.Structure Namespace